Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.SetVisibility Method
 Sets visibility for given model objects.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SetVisibility(
	List<ModelObject> modelObjects,
	bool? Visible
)
Public Shared Function SetVisibility (
	modelObjects As List(Of ModelObject),
	Visible As Boolean?
) As Boolean
Parameters
modelObjects
Type: System.Collections.Generic.List<ModelObject>
The list of model objects, null for all objects
Visible
Type: System.Nullable<Boolean>
Nullable boolean if to set to visible or reset state
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Tekla.Structures.Model.UI.ModelObjectVisualization.SetVisibility(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},System.Nullable{System.Boolean})"]
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace